Repository: DanielMesfin/unit_aqua_mobile_application
Catalog: lib/l10n/app_*.arb
Languages: am

source: Activate
am: አንቃ

# add_at_least_one_item
source: Please add at least one gift!
am: እባክህ ቢያንስ አንድ ስጦታ ጨምር!

# add_at_least_one_item_in_to_cart
source: Please add at least one gift to the cart!
am: እባክህ ቢያንስ አንድ ስጦታ ወደ ጋሪው ጨምር!

source: + Add New Contact
am: አዲስ የስልክ ቁጥር አድራሻ ጨምር

source: Add New Receiver
am: አዲስ ተቀባይ ጨምር

source: Add Phone Number
am: ስልክ ቁጥር ጨምር

source: Added to cart!
am: ወደ ጋሪው ተጨምሯል!

# alreadyHaveAccount
source: Already have an account?
am: መለያ አለህ?

source: Amount
am: መጠን

source: App Version
am: የመከወን ሥሪት

source: Apply to cart
am: በጋሪው ላይ አድርግ

source: Are you sure to deactivate your account?
am: በርግጥ መለያህን ማፍዘዝ ትፈልጋለህ?

# are_you_sure_to_remove_this_item
source: Are you sure you want to remove this gift?
am: በርግጥ ይህን ስጦታ ማስወገድ ትፈልጋለህ?

# both_password_must_much
source: Both passwords must match
am: ሁለቱም የይለፍ ቃሎች መመሳሰል አለባቸው

source: Buy Now
am: አሁኑኑ ግዛ

# cannot_be_empty
source: can't be empty!
am: ባዶ ሊሆን አይችልም!

source: Cart
am: ጋሪ

# check_your_email
source: Check your email inbox
am: የኢሜል ሳጥንህን ፈትሽ

source: Checkout
am: ጨርሰህ ውጣ

# choose_gift_receiver_to_share
source: Choose a gift receiver whom you'd want to share to
am: ልታጋራው የምትፈልገውን የስጦታ ተቀባይ ምረጥ፡፡

# choose_receiver
source: Choose Gift Receiver
am: የስጦታ ተቀባይ ምረጥ

source: Code Sent
am: ክታብ ተልኳል

source: Confirm Order
am: ትዕዛዝ አረጋግጥ

source: Pay Now
am: አሁን ክፈል

source: Confirm Password
am: የይለፍ ቃል አረጋግጥ

source: Contact Us
am: ይገናኙን

source: Contacts
am: የስልክ አድራሻዎች

source: Your Contacts
am: የስልክ አድራሻዎችህ

# contact_permission_message
source: Share your contacts so you can choose who you would like to invite. We will keep your contacts safe.
am: ማንን መጋበዝ እንደሚፈልጉ መምረጥ እንዲችሉ የስልክ አድራሻዎችህን ያጋሩ። የስልክ አድራሻዎችህን ደህንነት እናስጠብቃለን።

source: Agree
am: ተስማማ

source: No thanks
am: አይ አመሰግናለሁ

source: Continue with
am: በ... ይቀጥሉ

source: Create New Password
am: አዲስ የይለፍ ቃል ፍጠር

source: Create Account
am: መለያ ፍጠር

source: Deactivate account
am: መለያህን አፍዝዝ

source: Delivered
am: ደረሷል

# did_not_receive_code
source: Did not receive a code?
am: ክታብ አልደረሰህም?

source: Discover
am: ግለጥ

# do_not_have_account
source: Don't have an account?
am: መለያ የለህም?

source: Done
am: ሆኗል

# edit_receiver
source: Edit Gift Receiver
am: የስጦታ ተቀባይን አርም

source: Email Address
am: የኢሜል አድራሻ

source: Address
am: አድራሻ

# empty_cart
source: Seems like you have no gift in the cart
am: በጋሪው ውስጥ ምንም ስጦታ ያለ አይመስልም

# empty_promotion
source: Seems like there is not any promotions yet.
am: እስካሁን ምንም ማስተዋወቂያዎች ያለ አይመስሉም።

# enter_celebrity_code
source: Enter special gift receiver code here
am: ልዩ የስጦታ መቀበያ ክታብ እዚህ አስገባ

# enter_email_address_for_password_reset_instruction
source: Enter your email address to send you an instruction on how to reset your password
am: የይለፍ ቃልህን እንዴት መቀየር እንደምትችል መመሪያ እንድንልክልህ የኢሜል አድራሻህን አስገባ

# enter_receiver_code_here
source: Enter code here
am: ክታብ እዚህ አስገባ

# explore_page
source: Explore the home page for products and start sharing
am: ስለምርቶች ዋና ገጹን አስስ እና ማጋራት ጀምር

source: Explore Gifts
am: ስጦታዎችን አስስ

source: Exploring products
am: ምርቶችን ማሰስ

source: Feedback Content
am: የግብረመልስ ይዘት

# feed_back_title_error
source: Feedback name
am: የግብረመልስ ስም

source: Finish
am: ጨርስ

source: First Name
am: (የራስ) ስም

source: Forgot Password?
am: የይለፍ ቃልህን ረስተሀል?

# forgotPasswordInstruction
source: Please enter your email address so that we will send a link into your email to reset your password.
am: የይለፍ ቃልዎን እንደገና ለማስጀመር ወደ ኢሜልዎ ማስፈንጠሪያ እንድንልክልዎ እባክዎ የኢሜል አድራሻዎን ያስገቡ።

# fulfilled
source: Delivered
am: ደረሷል

source: Full Name
am: ሙሉ ስም

source: Gift Receiver
am: ስጦታ ተቀባይ

# giveGiftTagline
source: Give the gift of love! Using eStota App!
am: በeStota መከውን የፍቅር ስጦታ ስጥ!

source: Home
am: ዋና ገጽ

source: Filters
am: ማጣሪያዎች

source: My Orders
am: የእኔ ትእዛዞች

source: Edit Profile
am: መገለጫ አድስ

# review_description
source: thank you for choosing us today! To help us best serve you and others, could you give us feedback about your experience today?
am: ዛሬ እኛን ስለመረጡን እናመሰግናለን! እርስዎን እና ሌሎችን በተሻለ ሁኔታ እንድናገለግል እንዲረዳን ስለዛሬው ተሞክሮዎ አስተያየት ሊሰጡን ይችላሉ?

# editProfileDescription
source: You can edit detail information about yourself
am: ስለራስዎ ዝርዝር መረጃ ማደስ ይችላሉ።

# myOrdersDescription
source: Manage all your orders in one place
am: ሁሉንም ትዕዛዞችዎን በአንድ ቦታ ያስተዳድሩ::

# addressDescription
source: Manage your delivery addresses
am: የመላኪያ አድራሻዎችዎን ያስተዳድሩ::

# notificationDescription
source: Manage all your notifications
am: ሁሉንም ማሳወቂያዎችዎን ያስተዳድሩ

# settingDescription
source: Set your notification preferences and change password
am: የማሳወቂያ ምርጫዎችዎን ያዘጋጁ ፣ ቋንቋ እና የይለፍ ቃል ይቀይሩ፡፡

source: Create Profile
am: መገለጫ ፍጠር

source: Update Profile
am: መገለጫ አድስ

source: How It works
am: እንዴት እንደሚሰራ

source: Incorrect Email Address or Password
am: የተሳሳተ የኢሜል አድራሻ ወይም የይለፍ ቃል

source: Installed Claims
am: የተተከሉ ጥያቄዎች

# invalid_email_address
source: Provide valid email address
am: ትክክለኛ የኢሜይል አድራሻ አስገባ

# invalid_first_name
source: Provide valid first name
am: ትክክለኛ የ(ራስ) ስም አስገባ

# invalid_last_name
source: Provide valid last name
am: ትክክለኛ የአባት ስም አስገባ

# invalid_password
source: Password must be of 8 characters
am: የይለፍ ቃል 8 ፊደል መሆን አለበት

# invalid_phone_number
source: Provide valid phone number
am: ትክክለኛ ስልክ ቁጥር አስገባ

source: Invitation Success
am: ግብዣ ተሳክቷል

source: Invite
am: ጋብዝ

source: Invite contact
am: ባለስልክ አድራሻ ጋብዝ

# estota_collects_contact_list
source: Share your contacts so you can choose who you would like to invite. We will keep your contacts safe.
am: ኢ-ስጦታ ከጓደኞችህ ጋር ለመገናኘት በምትፈልግበት ጊዜ ማጋራትን ለማስቻል ኢ-ስጦታ መተግበሪያ የእርስዎን አድራሻ ዝርዝር ውሂብ ይሰበስባል

source: Notice
am: ማስታወቂያ

source: Ok
am: እሺ

source: Cancel
am: ሰርዝ

# you_need_to_accept_this_permission
source: we need {permission_name} permission
am: {feature_name} ባህሪ ለእርስዎ ለመፍቀድ {permission_name} ፈቃድ እንፈልጋለን

# by_using_estota_app_you_agree_to_our
source: By using eStota app you have agreed to our
am: ኢ-ስጦታን መተግበሪያን በመጠቀም በእኛ

source: Terms
am: ውሎች

source: and
am: እና

source: Privacy Policy
am: የግላዊነት ፖሊሲ

source: agreed
am: ተስማምተሃል።

# items
source: Gifts
am: ሰጦታዎች

source: Language
am: ቋንቋ

source: Last Name
am: የአባት ስም

source: Learn More
am: ተጨማሪ ይወቁ

source: Login
am: በውል ግቡ

# loginInstruction
source: Enter your email and password to login and get the best of Metahu Addis.
am: ለመግባት እና የመጣሁ አዲስን ምርጡን ለማግኘት ኢሜልዎን እና የይለፍ ቃልዎን ያስገቡ።

source: Login with Email
am: በኢሜል በውል ይግባ

source: Logout
am: በውል ውጣ

source: Are you sure you really want to logout?
am: እርግጠኛ ነህ ዘግተህ መውጣት ትፈልጋለህ?

source: My Progress
am: ዘለቃዬ

source: My Rewards
am: ሽልማቶቼ

source: Name
am: ስም

# new_receiver
source: New Gift Receiver
am: አዲስ ስጦታ ተቀባይ

source: Next
am: ቀጣይ

source: No
am: የለም

# no_contacts
source: Seems like you have no contact!
am: የስልክ አድራሻ ያለዎት አይመስልም!

# no_phone_number
source: Seems like you have no phone number registered, please add to continue
am: የተመዘገበ ስልክ ቁጥር ያለህ አይመስልም፣ ለመቀጠል እባክህ ጨምር

# no_receiver_found
source: Seems like you don't have a gift receiver, please add a gift receiver
am: ስጦታ ተቀባይ ያለህ አይመስልም፣ እባክዎን ስጦታ ተቀባይ ጨምር

# not_logged_in
source: Seems like you haven't logged in, Login or Signup to fully use all our features
am: በውል የገባህ አይመስልም፤ በሁሉም የመከውናችን ባህርያት ለመጠቀም በውል ግባ ወይም መዝገብ

source: Notifications
am: ማሳወቂያ

source: OrderNumber:
am: የትእዛዝ ቁጥር:

source: Password
am: የይለፍ ቃል

source: Enter your address
am: አድራሻዎትን ያስገቡ

# password_reset
source: Reset Password
am: የይለፍ ቃልዎን ቀይር

source: Password reset success
am: የይለፍ ቃልህ በትክክል ተቀይሯል

source: Payment
am: ክፍያ

source: Payment Completed
am: ክፍያ ተጠናቅቋል።

source: Payment Failed
am: ክፍያ አልተሳካም።

source: Payment Type
am: የክፍያ ዓይነት

source: Pending
am: ያልተፈጸመ

source: Phone
am: ስልክ

source: Phone Number
am: ስልክ ቁጥር

source: Please select at least one Contact!
am: እባክህ ቢያንስ አንድ የስልክ አድራሻ ምረጥ

source: Product Description
am: የምርት ማብራሪያ

source: Products
am: ምርቶች

source: Profile
am: ገጸባህሪ

source: Promotions
am: ማስተዋወቂያዎች

# provide_valid
source: Provider valid
am: አቅራቢው ፍቱን (ነው)

source: Purchase History
am: የግዢ ዝርዝር

# purchase_history_empty
source: Seems like you haven't made any purchase just yet
am: እስካሁን ምንም አይነት ግዢ የፈጸምክ አይመስልም።

# purchase_success_message
source: Thank you for making your gift receiver happy! You can get the purchase info under purchase history from the settings screen.
am: ስጦታ ተቀባይህን ስላስደሰትክ እናመሰግናለን፦ በግዢ ሰነድ ስር ያለውን የግዢ መረጃ ከማስተካከያዎች ማያ ገጽ ማግኘት ትችላለህ።

source: Quantity
am: ብዛት

# receiver_list
source: Gift Receiver List
am: የስጦታ ተቀባይ ዝርዝር

source: Redeem
am: በሽልማትህ ክፈል

# remaining_redeem
source: Remaining Redeems
am: ከሽልማትህ ቀሪ

source: Remove
am: አስወግድ

# remove_item
source: Remove this gift?
am: አስወግድ

# remove_receiver
source: Remove Gift Receiver
am: ይህ ስጦታ አስወግድ

# resend
source: Resend Code
am: የሚስጥር ቁልፍ እንደገና ላክ

# reward_progress
source: You have redeemed {percentage}% of your reward
am: የሽልማትዎን {percentage}% ወደክፍያ ለውጠሃል።

source: Search
am: ይፈልግ

# search_celebrity
source: Search Special Gift Receiver
am: ልዩ ስጦታ ተቀባይን ፈልግ

source: Send
am: ላክ

source: Send your gifts
am: ስጦታዎችህን ላክ

source: Sending...
am: እየላከ ነው

source: Settings
am: ማስተካከያዎች

source: Setup
am: አዘገጃጀት

source: Share
am: ያጋር

# share_description
source: Do you want someone to send you gift? Or you just want to share this product?
am: ስጦታ እንዲላክልህ ትፈልጋለህ፧ ወይንም ይህን ምርት ማጋራት ትፈልጋለህ፧

source: Share link
am: መሰናስሉን አጋራ

source: Share this product
am: ይህን ምርት አጋራ

source: Sharing...
am: እያጋራ ነው

source: SignUp
am: መዝገብ

# skip_login
source: Skip
am: አሳልፍ

source: Something to tell us ?
am: የምትነግረን ነገር አለ?

source: Something went wrong
am: የሆነ ስህተት ተከስቷል

source: Special Receiver
am: ልዩ ተቀባይ

source: Start Sharing
am: ማጋራት ጀመር

source: Start sharing today
am: ዛሬውኑ ማጋራት ጀምር

source: Started
am: ተጀመረ

source: SubTotal
am: ንዑስ ድምር፡

source: Thank you for reaching out
am: እኛን በመገናኘትህ እናመሰግናለን

source: Title
am: ርዕስ

source: Total Price:
am: ጠቅላላ ዋጋ:

source: Unknown
am: ያልታወቀ

source: Update Receiver
am: ተቀባዩን አዘምን

# we_are_glad_you_are_here
source: We're glad you're here
am: እኛ ዘንድ በመሆንህ ደስ ብሎናል።

# we_have_sent_an_email_check_your_email_for_activation_code
source: We've just sent you an email. Please check your email inbox and enter the activation code
am: አሁን ኢሜይል ልከናል። እባክህ የኢሜል ሳጥንህን አረጋግጥ እና የተላከልህን ክታብ እዚህ አስገባ

source: Welcome
am: እንኳን ደህና መጡ

source: Welcome Back
am: ዳግም እንኳን ደህና መጡ

source: Write reason to contact
am: እኛን ለመገናኘት ምክንያት የሆነህን ነገር ጻፍ

source: Yes
am: አዎ

# greeting
source: Hey, {userFullName}
am: ሰላም {userFullName}

source: How satisfied are you with our service?
am: በአገልግሎታችን ምን ያህል ረክተዋል?

# review_suggestion
source: What do you suggest we should work on more to be the best delivery platform.
am: ምርጡ የመላኪያ መድረክ ለመሆን የበለጠ መስራት እንዳለብን ምን ይጠቁማሉ።

# optional_but_important_for_us
source: Optional, but very important for us
am: ግዴታ አይደለም, ግን ለእኛ በጣም አስፈላጊ ነው

source: Phone contacts list
am: የስልክ አድራሻዎች ዝርዝር

source: Share from phone contacts list
am: ከስልክ አድራሻዎች ዝርዝር ማጋራት

# your_new_password_must_be_differ_from_previous
source: Your new password must be different from your previous password
am: አዲሱ የይለፍ ቃልህ ከቀዳሚው የይለፍ ቃልህ የተለየ መሆን አለበት።

# your_special_receiver_will_appear_here
source: Your special gift receivers will appear here.
am: የአንተ ልዩ ስጦታ ተቀባዮች እዚህ ይታያሉ።

# no_rewards
source: Seems like you have no rewards yet please go to promotions page to get your rewards.
am: እስካሁን ምንም ሽልማቶች ያለዎት አይመስልም እባኮትን ሽልማቶችን ለማግኘት ወደ ማስተዋወቂያ ገፅ ይሂዱ።

# expires_on
source: Expires on {date}
am: {date} ላይ ጊዜው ያበቃል

# of_value
source: {valueOne} of {valueTwo}
am: {valueOne} ከ {valueTwo}
